---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuiltInFailures..::..FluidFailures Properties
BuiltInFailures..::..FluidFailures Class See Also Send Feedback
---

The BuiltInFailures..::..FluidFailures type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | UndefinedFluidType | The fluid type '[Type Name]' is not defined |

# See Also

BuiltInFailures..::..FluidFailures Class

Autodesk.Revit.DB Namespace